UTAF_Base/requestFiles/PTS_GetOrganisation.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:v2="http://api.web.bc/api/schema/commoncontext/v2" xmlns:v1="http://api.web.bc/api/schema/commoncontext/transaction/v1"
	xmlns:v11="http://api.web.bc/api/schema/commoncontext/consumertransaction/v1"
	xmlns:v3="http://api.web.bc/capability/business/b182/services/organisation/v3"
	xmlns:v21="http://api.web.bc/capability/business/b182/objects/requestgetorganisation/v2">
	<soapenv:Header>
		<v2:CommonContextRequest>
			<v2:transaction>
				<v1:messageId>${Req_corrId}</v1:messageId>
				<v1:correlationId>${Req_correlationId}</v1:correlationId>
				<v1:conversationId>${Req_conversationId}</v1:conversationId>
				<v1:dateTimeCreated>${Req_dateTimeCreated}</v1:dateTimeCreated>
			</v2:transaction>
			<v2:consumerTransaction>
				<v11:businessTransactionId>${Req_corrId}</v11:businessTransactionId>
			</v2:consumerTransaction>
		</v2:CommonContextRequest>
	</soapenv:Header>
	<soapenv:Body>
		<v3:RequestDataGetOrganisation version="3.0">
			<v3:serviceContext>
				<!--Optional: -->
				<v3:scoping>
					<v3:functionalScope>
						<v21:value>${Req_functionalScope}</v21:value>
					</v3:functionalScope>
				</v3:scoping>
				<v3:transactionData>
					<v3:endUserLanguage>EN</v3:endUserLanguage>
					<v3:consumerApplication>CDB</v3:consumerApplication>
				</v3:transactionData>
			</v3:serviceContext>
			<v3:serviceData>
				<v3:organisationIdentifier>
					<v21:id>${Req_id}</v21:id>
					<v21:idScope>
						<v21:value>${Req_idScope}</v21:value>
					</v21:idScope>
					<v21:idContext>
						<v21:value>${Req_idContext}</v21:value>
					</v21:idContext>
				</v3:organisationIdentifier>
			</v3:serviceData>
		</v3:RequestDataGetOrganisation>
	</soapenv:Body>
</soapenv:Envelope>
